In [1]:
import pandas as pd
import pymysql

In [3]:
conn = pymysql.connect(host='localhost',port=int(3306), user='root', passwd='1a_2b_3c_4d$', db='tutorial')
conn

# Retrieving the list of tables in the database

In [6]:
tables_name = pd.read_sql_query("""Select 
  Table_name as Tablesname 
FROM 
  information_schema.tables 
WHERE 
  table_schema = 'tutorial'""",conn)
tables_name

   Tablesname
0    accounts
1      orders
2     regions
3  sales_reps
4  web_events

# Starting with accounts table: 'Checking for null values'

In [8]:
null_values = pd.read_sql_query("""

SELECT 
    SUM(ISNULL(id)) AS id_null,
    SUM(ISNULL(name)) AS name_null,
    SUM(ISNULL(primary_contact)) AS primary_contact_null,
    SUM(ISNULL(sales_rep_id)) AS sales_rep_id_null,
    SUM(ISNULL(region_id)) AS region_id_null
FROM
    accounts""",conn)
null_values

   id_null  name_null  primary_contact_null  sales_rep_id_null  region_id_null
0      0.0        0.0                   0.0                0.0             0.0

*No null values in the accounts table*

**So, let's split the primary _contact column in two columns : 'First Name' & 'Last Name'**

In [11]:
position = pd.read_sql_query("""

/* ----  Method 1 ----  */

SELECT 
    POSITION(' ' IN primary_contact) AS position
FROM
    accounts
    LIMIT 10;""",conn)
position

   position
0         6
1         6
2         9
3         7
4         7
5         7
6         9
7         0
8         7
9         9

In [13]:
FNAME_LNAME = pd.read_sql_query("""

SELECT 
    LEFT(primary_contact,
        POSITION(' ' IN primary_contact) - 1) AS First_Name,
    RIGHT(primary_contact,
        LENGTH(primary_contact) - POSITION(' ' IN primary_contact)) AS Last_Name
FROM
    accounts
LIMIT 10;""",conn)

FNAME_LNAME

  First_Name  Last_Name
0      Cammy  Sosnowski
1      Sasha    Haughey
2   Chanelle      Keach
3     Elayne  Grunewald
4     Jewell      Likes
5     Tamara       Tuma
6   Laurette      Sakai
7
8     Wynell     Lepore
9   Cathleen  Delamater

In [14]:
FNAME_LNAME_2 = pd.read_sql_query("""

/* ---- Method 2 ---- */

SELECT 
    SUBSTRING_INDEX(primary_contact, ' ', 1) AS First_Name,
    SUBSTRING_INDEX(primary_contact, ' ', - 1) AS Last_Name
FROM
    accounts
LIMIT 10;""",conn)

FNAME_LNAME_2

  First_Name  Last_Name
0      Cammy  Sosnowski
1      Sasha    Haughey
2   Chanelle      Keach
3     Elayne  Grunewald
4     Jewell      Likes
5     Tamara       Tuma
6   Laurette      Sakai
7
8     Wynell     Lepore
9   Cathleen  Delamater

# Let's discover the amount of Sales Reps assigned per each region

In [15]:
sales_reps_no = pd.read_sql_query("""

SELECT 
    r.name, COUNT(DISTINCT(sales_rep_id)) AS NO_Sales_Assigned
FROM
    accounts AS a
        LEFT OUTER JOIN
    regions AS r ON r.id = a.region_id
GROUP BY r.name
ORDER BY 2 DESC""",conn)

sales_reps_no

        name  NO_Sales_Assigned
0  Northeast                 21
1  Southeast                 10
2       West                 10
3    Midwest                  9

*Let's check if there are sales_reps not assigned to any regions*

In [16]:
null_regions = pd.read_sql_query("""

SELECT 
    SUM(ISNULL(r.name)) AS NULL_VALUES_REGION, SUM(ISNULL(a.sales_rep_id)) AS NULL_VALUS_SALES_REP
FROM
    accounts AS a
        LEFT OUTER JOIN
    regions AS r ON r.id = a.region_id""",conn)

null_regions

   NULL_VALUES_REGION  NULL_VALUS_SALES_REP
0                 0.0                   0.0

*All our sales reps are assigned to regions*

## Now, let's head to our sales reps table. We have had a new company domain, and we need to change all the company emails to have a suffix "@pioneers.org"

In [17]:
email = pd.read_sql_query("""

SELECT 
    CONCAT(SUBSTRING_INDEX(email, '@', 1),
            '@',
            'pioneers.org') AS Email
FROM
    sales_reps
LIMIT 10;""",conn)

email

                         Email
0          racine@pioneers.org
1         e_esser@pioneers.org
2        averette@pioneers.org
3   renetta-carew@pioneers.org
4          clarke@pioneers.org
5    laveraoles35@pioneers.org
6          felder@pioneers.org
7       sh-selke8@pioneers.org
8         lauria2@pioneers.org
9  necole-victory@pioneers.org

## Now, we want to extract our "Area Code", which is the first 3 numbers in the phone number column, and originate a separate column for the phone number

In [18]:
Area_Phone = pd.read_sql_query("""

SELECT 
    SUBSTRING(phone_number, 2, 3) AS Area_Code,
    SUBSTRING_INDEX(phone_number, ' ', - 1) AS Phone_Number
FROM
    sales_reps
LIMIT 10;""",conn)

Area_Phone

  Area_Code Phone_Number
0       841     624-5766
1       468     366-7887
2       502     659-8223
3       221     623-6311
4       450     841-3704
5       173     886-6776
6       983     480-2956
7       621     180-7479
8       661     199-8942
9       857     252-3820

# Returning to the accounts table. We want to retrieve all sales_reps information associated with each account

In [19]:
sales_info = pd.read_sql_query("""

SELECT
    s.id,
    s.first_name,
    s.last_name,
    r.name AS Region,
    a.name AS Account,
    CONCAT(SUBSTRING_INDEX(email, '@', 1),
            '@',
            'pioneers.org') AS Email,
    SUBSTRING(phone_number, 2, 3) AS Area_Code,
    SUBSTRING_INDEX(phone_number, ' ', - 1) AS Phone_Number
FROM
    ((sales_reps AS s
    INNER JOIN regions AS r ON r.id = s.region_id)
    INNER JOIN accounts AS a ON s.id = a.sales_rep_id)
LIMIT 10;""",conn)

sales_info

,id,first_name,last_name,Region,Account,Email,Area_Code,Phone_Number
0,321500.0,Samuel,Racine,Northeast,Johnson Controls,racine@pioneers.org,841,624-5766
1,321500.0,Samuel,Racine,Northeast,American Airlines Group,racine@pioneers.org,841,624-5766
2,321500.0,Samuel,Racine,Northeast,Ingram Micro,racine@pioneers.org,841,624-5766
3,321500.0,Samuel,Racine,Northeast,Freddie Mac,racine@pioneers.org,841,624-5766
4,321500.0,Samuel,Racine,Northeast,Express Scripts Holding,racine@pioneers.org,841,624-5766
5,321500.0,Samuel,Racine,Northeast,Walmart,racine@pioneers.org,841,624-5766
6,321510.0,Eugena,Esser,Northeast,Best Buy,e_esser@pioneers.org,468,366-7887
7,321510.0,Eugena,Esser,Northeast,Delta Air Lines,e_esser@pioneers.org,468,366-7887
8,321510.0,Eugena,Esser,Northeast,Energy Transfer Equity,e_esser@pioneers.org,468,366-7887
9,321510.0,Eugena,Esser,Northeast,PepsiCo,e_esser@pioneers.org,468,366-7887

# Let's figure out the number of sales_reps assigned per each account

In [20]:
acct_sales = pd.read_sql_query("""

SELECT 
    DISTINCT(name), COUNT(DISTINCT (sales_rep_id)) AS sales_rep_assigned
FROM
    accounts
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;""",conn)

acct_sales

                      name  sales_rep_assigned
0                       3M                   1
1      Abbott Laboratories                   1
2                   AbbVie                   1
3                      ADP                   1
4       Advance Auto Parts                   1
5  Advanced Micro Devices                    1
6                    AECOM                   1
7                      AES                   1
8                    Aetna                   1
9                    Aflac                   1

*Each account has one sales rep assigned to it*

# Let's head to the orders table, and check how much each paper type quantity & usd_amt contribute to the total

In [22]:
paper_qty_pct_total = pd.read_sql_query("""

/* ---- Quantity ---- */

SELECT 
    ROUND(100 * SUM(standard_qty) / SUM(total), 2) AS standard_percent_total,
    ROUND(100 * SUM(gloss_qty) / SUM(total), 2) AS gloss_percent_total,
    ROUND(100 * SUM(poster_qty) / SUM(total), 2) AS poster_percent_total
FROM
    orders""",conn)


paper_qty_pct_total

   standard_percent_total  gloss_percent_total  poster_percent_total
0                   52.73                27.58                 19.69

In [23]:
paper_amt_pct_total = pd.read_sql_query("""

/* ---- amt_usd ---- */

SELECT 
    ROUND(100 * SUM(standard_amt_usd) / SUM(total_amt_usd), 2) AS standard_percent_total,
    ROUND(100 * SUM(gloss_amt_usd) / SUM(total_amt_usd), 2) AS gloss_percent_total,
    ROUND(100 * SUM(poster_amt_usd) / SUM(total_amt_usd), 2) AS poster_percent_total
FROM
    orders""",conn)

paper_amt_pct_total

   standard_percent_total  gloss_percent_total  poster_percent_total
0                    41.8                32.81                 25.39

*As we can see, in both cases, standard type has th highest contribution, followed by gloss and ending with poster*

# Let's analyze accounts based on total quantity sold, and average quantity sold. Also, total_amt_usd per account vs. average amt_usd per account and the running average

In [24]:
total = pd.read_sql_query("""

SELECT 
    a.name, SUM(o.total) AS Total_Qty_Sold, ROUND(SUM(o.total_amt_usd),2) AS Total_USD
FROM
    accounts AS a
        INNER JOIN
    orders AS o ON a.id = o.account_id
GROUP BY a.name
ORDER BY 2 DESC , 3 DESC
LIMIT 10;""",conn)

total

                name  Total_Qty_Sold  Total_USD
0      EOG Resources         56410.0  382873.30
1             Mosaic         49246.0  345618.59
2                IBM         47506.0  326819.48
3  Core-Mark Holding         44750.0  231856.98
4   General Dynamics         43730.0  300694.79
5  Leucadia National         42358.0  291047.25
6  Arrow Electronics         40904.0  281018.36
7  Republic Services         40833.0  293861.14
8              Sysco         40535.0  278575.64
9          Supervalu         40412.0  275288.30

*As, it's clear, the top Sales accounts 'all time' are: EOG Resources, Mosaic, and IBM*

In [29]:
running_total_yearly = pd.read_sql_query("""

/* ----Running Total Yearly ------*/

SELECT name, Year, ROUND(SUM(Total_Qty_Sold) OVER w,2) AS Qty_running_total,
SUM(Total_USD) OVER w AS USD_running_total
FROM

(SELECT 
    a.name,
    EXTRACT(YEAR FROM o.occurred_at) AS Year,
    SUM(o.total) AS Total_Qty_Sold,
    ROUND(SUM(o.total_amt_usd), 2) AS Total_USD
FROM
    accounts AS a
        INNER JOIN
    orders AS o ON a.id = o.account_id
GROUP BY 1 , 2
ORDER BY 2 DESC , 3 DESC) SUB

WINDOW w AS (PARTITION BY name ORDER BY Year)
LIMIT 10;""",conn)

running_total_yearly

                  name  Year  Qty_running_total  USD_running_total
0                   3M  2015             8891.0           57050.09
1                   3M  2016            19747.0          127945.10
2  Abbott Laboratories  2013              140.0             848.84
3  Abbott Laboratories  2014             9860.0           65451.49
4  Abbott Laboratories  2015            14707.0           96819.92
5               AbbVie  2016             1725.0           11243.63
6                  ADP  2013              371.0            1904.48
7                  ADP  2014            11798.0           74069.49
8                  ADP  2015            21602.0          126123.14
9                  ADP  2016            28629.0          163579.18

running_total_monthly = pd.read_sql_query("""

/* ----Running Total Monthly ------*/

SELECT name, Month, ROUND(SUM(Total_Qty_Sold) OVER w,2) AS Qty_running_total,
SUM(Total_USD) OVER w AS USD_running_total
FROM

(SELECT 
    a.name,
    EXTRACT(MONTH FROM o.occurred_at) AS Month,
    SUM(o.total) AS Total_Qty_Sold,
    ROUND(SUM(o.total_amt_usd), 2) AS Total_USD
FROM
    accounts AS a
        INNER JOIN
    orders AS o ON a.id = o.account_id
GROUP BY 1 , 2
ORDER BY 2 DESC , 3 DESC) SUB

WINDOW w AS (PARTITION BY name ORDER BY Month)

LIMIT 10;""",conn)

running_total_monthly

In [19]:
%%sql

/* ----Running Total Daily ------*/

SELECT name, Day, SUM(Total_Qty_Sold) OVER w AS Qty_running_total,
SUM(Total_USD) OVER w AS USD_running_total
FROM

(SELECT 
    a.name,
    EXTRACT(DAY FROM o.occurred_at) AS Day,
    SUM(o.total) AS Total_Qty_Sold,
    ROUND(SUM(o.total_amt_usd), 2) AS Total_USD
FROM
    accounts AS a
        INNER JOIN
    orders AS o ON a.id = o.account_id
GROUP BY 1 , 2
ORDER BY 2 DESC , 3 DESC) SUB

WINDOW w AS (PARTITION BY name ORDER BY Day)
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('3M', 2, 3394.0, 23090.99),
 ('3M', 3, 3559.0, 24111.41),
 ('3M', 5, 4982.0, 33401.31),
 ('3M', 6, 6233.0, 41250.89),
 ('3M', 7, 8132.0, 53424.24),
 ('3M', 8, 10849.0, 70460.75),
 ('3M', 9, 12450.0, 81161.5),
 ('3M', 23, 13946.0, 90973.86),
 ('3M', 25, 15367.0, 100333.69),
 ('3M', 27, 17310.0, 112594.3)]

# Let's check qty_sold, and usd_total on average

In [31]:
avg_sales = pd.read_sql_query("""
SELECT 
    a.name,
    EXTRACT(YEAR FROM o.occurred_at) AS Date,
    AVG(o.total) AS AVG_Qty_Sold,
    ROUND(AVG(o.total_amt_usd), 2) AS AVG_USD
FROM
    accounts AS a
        INNER JOIN
    orders AS o ON a.id = o.account_id
GROUP BY 1 , 2
ORDER BY 2 DESC , 3 DESC
LIMIT 10;""",conn)

avg_sales

                  name  Date  AVG_Qty_Sold  AVG_USD
0                  UPS  2017         837.0  5339.38
1         Devon Energy  2017         730.5  4768.28
2                 Visa  2017         662.5  4613.02
3        W.W. Grainger  2017         601.5  4192.30
4        Valero Energy  2017         592.5  4120.80
5         Land O'Lakes  2017         494.0  2493.23
6  United States Steel  2017         489.5  3273.30
7              Stryker  2017         388.0  2260.68
8               Anthem  2017         385.0  2274.53
9   Genworth Financial  2017         312.5  1737.62

*The highest on average goes to UPS followd by Devon Energy and Visa*

# Now, let's check sales_reps performance

In [32]:
sales_performance = pd.read_sql_query("""

/* ------Analyzing SALES Performance Yearly ----*/ 

SELECT 
    SALES_ID, total_Qty_sold, total_usd_amt, Year
FROM
    (SELECT DISTINCT
        (a.sales_rep_id) AS SALES_ID,
            SUM(o.total) AS total_Qty_sold,
            ROUND(SUM(o.total_amt_usd),2) AS total_usd_amt,
            EXTRACT(YEAR FROM o.occurred_at) AS Year
    FROM
        accounts AS a
    INNER JOIN orders AS o ON a.id = o.account_id
    GROUP BY 1) SUB
ORDER BY 2 DESC, 3 DESC
LIMIT 10;""",conn)

sales_performance

   SALES_ID  total_Qty_sold  total_usd_amt  Year
0  321800.0        174430.0     1098137.72  2013
1  321640.0        152638.0     1010690.60  2016
2  321840.0        150467.0      934212.93  2016
3  321970.0        134198.0      886244.12  2016
4  321940.0        122103.0      810353.34  2016
5  321890.0        120602.0      749076.16  2013
6  321820.0        119338.0      766935.04  2016
7  321810.0        115346.0      650393.52  2016
8  321960.0        115156.0      655954.74  2016
9  321830.0        112684.0      702697.29  2013

*Analyzing year 2016*

In [33]:
performance_yearly = pd.read_sql_query("""

/* ------Analyzing SALES Performance Yearly ----*/ 

SELECT 
    SALES_ID, total_Qty_sold, total_usd_amt, Year
FROM
    (SELECT DISTINCT
        (a.sales_rep_id) AS SALES_ID,
            SUM(o.total) AS total_Qty_sold,
            ROUND(SUM(o.total_amt_usd),2) AS total_usd_amt,
            EXTRACT(YEAR FROM o.occurred_at) AS Year
    FROM
        accounts AS a
    INNER JOIN orders AS o ON a.id = o.account_id
    GROUP BY 1) SUB
    WHERE Year = 2016
ORDER BY 2 DESC, 3 DESC
LIMIT 10;""",conn)

performance_yearly

   SALES_ID  total_Qty_sold  total_usd_amt  Year
0  321640.0        152638.0     1010690.60  2016
1  321840.0        150467.0      934212.93  2016
2  321970.0        134198.0      886244.12  2016
3  321940.0        122103.0      810353.34  2016
4  321820.0        119338.0      766935.04  2016
5  321810.0        115346.0      650393.52  2016
6  321960.0        115156.0      655954.74  2016
7  321910.0        102351.0      675917.64  2016
8  321690.0         88533.0      550973.02  2016
9  321980.0         83589.0      488448.47  2016

# Let's head to web_events table to analyz the partition of each channel regarding sales_reps, sales_qty, sales_usd

In [34]:
channel_freq = pd.read_sql_query("""

/* ---- Channel Most Frequently Occuring ----*/

SELECT 
    channel, COUNT(*) AS CHANNEL_FREQ
FROM
    web_events
GROUP BY channel
ORDER BY 2 DESC
LIMIT 10;""",conn)

channel_freq

    channel  CHANNEL_FREQ
0    direct          3979
1   organic           155
2  facebook           145
3   adwords           126
4    banner            72
5   twitter            64
6      93.0             6
7      76.0             5
8     139.0             5
9     524.0             5

*Direct has the highest percent of occurence*

In [35]:
channel_sales = pd.read_sql_query("""

/*-------Sales Reps assigned per each channel -------*/


SELECT 
    w.channel, COUNT(DISTINCT (a.sales_rep_id)) AS NO_SALES_ASSIGNED
FROM
    web_events AS w
        INNER JOIN
    accounts AS a ON a.id = w.account_id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;""",conn)

channel_sales

    channel  NO_SALES_ASSIGNED
0    direct                 50
1   adwords                 28
2   organic                 28
3  facebook                 27
4    banner                 25
5   twitter                 24
6      76.0                  5
7     139.0                  5
8     901.0                  5
9      93.0                  5

In [36]:
channel_profit = pd.read_sql_query("""

/*----------Channel Profit ----------*/

SELECT 
    w.channel, SUM(o.total) AS Total_QTY, SUM(o.total_amt_usd) AS Total_USD
FROM
    ((web_events AS w
        INNER JOIN
    accounts AS a ON a.id = w.account_id)
    INNER JOIN orders AS o
    ON a.id = o.account_id)
GROUP BY 1
ORDER BY 2 DESC,3 DESC
LIMIT 10;""",conn)

channel_profit

    channel   Total_QTY     Total_USD
0    direct  78962237.0  4.966047e+08
1   organic   3288637.0  2.052272e+07
2  facebook   3104350.0  1.959432e+07
3   adwords   2498359.0  1.590680e+07
4    banner   1465855.0  9.276700e+06
5   twitter   1150299.0  7.163836e+06
6     822.0    135786.0  8.783603e+05
7     173.0    133178.0  8.707731e+05
8      93.0    126926.0  6.970887e+05
9      74.0    106015.0  6.756471e+05

*The most profitable channel is direct followed by organic and facebook
So, lt's analyze our top 6 channels only*

In [37]:
top_6_channels = pd.read_sql_query("""

/*----------Top 6 Channels only ---------------*/


SELECT 
    w.channel, SUM(o.total) AS Total_QTY, SUM(o.total_amt_usd) AS Total_USD
FROM
    ((web_events AS w
        INNER JOIN
    accounts AS a ON a.id = w.account_id)
    INNER JOIN orders AS o
    ON a.id = o.account_id)
GROUP BY 1
HAVING UPPER(channel) IN ('DIRECT','ORGANIC','FACEBOOK','ADWORDS','BANNER','TWITTER')
ORDER BY 2 DESC,3 DESC""",conn)

top_6_channels

    channel   Total_QTY     Total_USD
0    direct  78962237.0  4.966047e+08
1   organic   3288637.0  2.052272e+07
2  facebook   3104350.0  1.959432e+07
3   adwords   2498359.0  1.590680e+07
4    banner   1465855.0  9.276700e+06
5   twitter   1150299.0  7.163836e+06

In [38]:
running_total_net_profit = pd.read_sql_query("""

/*------channel running total & Net Profit ----------*/



SELECT channel, Year, QTY_running_total, USD_running_total, LAG_USD_running_total, 
       LEAD_USD_running_total, ROUND((LEAD_USD_running_total - LAG_USD_running_total),2) AS Net_Profit
FROM

(SELECT  channel, Year, QTY_running_total, USD_running_total, 
         COALESCE(LAG_USD_running_total,0) AS LAG_USD_running_total , 
         COALESCE(LEAD_running_total,0) AS LEAD_USD_running_total
FROM
 
(SELECT 
    channel, Year, SUM(Total_QTY) OVER w AS QTY_running_total,
    ROUND(SUM(Total_USD) OVER w,2) AS USD_running_total,
    ROUND(LAG(Total_USD) OVER w,2) AS LAG_USD_running_total,
    ROUND(LEAD(Total_USD) OVER w,2) AS LEAD_running_total
 
FROM
 
    (SELECT 
        w.channel,
            SUM(o.total) AS Total_QTY,
            SUM(o.total_amt_usd) AS Total_USD,
            EXTRACT(YEAR FROM w.occurred_at) AS Year
     
    FROM
     
        ((web_events AS w
    INNER JOIN accounts AS a ON a.id = w.account_id)
    INNER JOIN orders AS o ON a.id = o.account_id)
    GROUP BY 1,4
    HAVING UPPER(channel) IN ('DIRECT' , 'ORGANIC', 'FACEBOOK', 'ADWORDS', 'BANNER', 'TWITTER')) SUB
WINDOW w AS (PARTITION BY channel ORDER BY Year)) SUB) SUB1

LIMIT 10;""",conn)

running_total_net_profit

,channel,Year,QTY_running_total,USD_running_total,LAG_USD_running_total,LEAD_USD_running_total,Net_Profit
0,adwords,2013,87749.0,572111.45,0.00,5.119315e+06,5.119315e+06
1,adwords,2014,880747.0,5691426.63,572111.45,4.209406e+06,3.637294e+06
2,adwords,2015,1569509.0,9900832.56,5119315.18,5.995284e+06,8.759692e+05
3,adwords,2016,2496685.0,15896116.93,4209405.93,1.067877e+04,-4.198727e+06
4,adwords,2017,2498359.0,15906795.70,5995284.37,0.000000e+00,-5.995284e+06
5,banner,2013,99529.0,644096.80,0.00,3.099822e+06,3.099822e+06
6,banner,2014,592497.0,3743918.32,644096.80,2.393061e+06,1.748965e+06
7,banner,2015,970252.0,6136979.78,3099821.52,3.139720e+06,3.989869e+04
8,banner,2016,1465855.0,9276699.99,2393061.46,0.000000e+00,-2.393061e+06
9,direct,2013,1491837.0,9257599.41,0.00,1.111173e+08,1.111173e+08

# Finally, it seems that the date column in web_events table needs some work. So, let's reformat the date column in much proper way "dd-mm-yyyy"

In [39]:
date = pd.read_sql_query("""

/*-----------Date Reformatted ----------*/

SELECT 
    id,
    account_id,
    channel,
    CONCAT( SUBSTRING(SUBSTRING_INDEX(occurred_at, '-', -2),4,2),
            '-',
            RIGHT(SUBSTRING_INDEX(occurred_at, '-', 2),2),
            '-',
            LEFT(occurred_at, 4)) AS Date
FROM
    web_events
LIMIT 10;""",conn)

date

       id  account_id channel        Date
0     1.0      1001.0  direct  06-10-2015
1  3304.0      3531.0  direct  02-07-2015
2     3.0      1001.0  direct  04-12-2015
3     4.0      1001.0  direct  02-01-2016
4  3306.0      3531.0   228.0  01-02-2016
5  3307.0      3531.0  direct  02-03-2016
6     7.0      1001.0  direct  01-04-2016
7  3308.0      3531.0  direct  28-10-2015
8     9.0      1001.0  direct  31-05-2016
9    10.0      1001.0  direct  30-06-2016